In [ ]:

## 전처리 작업 
데이터 분석의 정확도는 분석데이터의 품질에 따라 좌우된다.
데이터 품질을 높이기 위해서는 누락데이터(NaN), 중복데이터 등 오유를 수정할 필요가 있다.
수집한 데이터를 분석에 적합하도록 사전 처리하는 것을 전처리라고 한다.


### 누락 데이터 확인

In [1]:
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [7]:
df['deck'].value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [9]:
df.head().isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [11]:
df.head().notnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [13]:
df.head().isna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [19]:
df.head().notna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [15]:
df.head().isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

In [17]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
## 누락데이터 제거

누락데이터가 있는 행 또는 열을 삭제 
df.dropna(axis=1, thresh=500)
axis=1 : 열방향
thresh=n : 누락데이터가 n개 이상일 때 삭제하는 조건

In [75]:
df_deck_pre = df.dropna(axis=1, thresh=500)
df_deck_pre.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [77]:
df_deck_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB

In [79]:
df_age_pre = df_deck_pre.dropna(subset=['age'], how='any', axis=0)

In [81]:
df_age_pre.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   sibsp        714 non-null    int64
 5   parch        714 non-null    int64
 6   fare         714 non-null    float64
 7   embarked     712 non-null    object
 8   class        714 non-null    category
 9   who          714 non-null    object
 10  adult_male   714 non-null    bool
 11  embark_town  712 non-null    object
 12  alive        714 non-null    object
 13  alone        714 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 69.2+ KB

In [95]:
df_embark_town_pre = df_age_pre.dropna(subset=['embark_town'], how='any', axis=0)
final_712 = df_embark_town_pre

In [97]:
final_712.info()

<class 'pandas.core.frame.DataFrame'>
Index: 712 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     712 non-null    int64
 1   pclass       712 non-null    int64
 2   sex          712 non-null    object
 3   age          712 non-null    float64
 4   sibsp        712 non-null    int64
 5   parch        712 non-null    int64
 6   fare         712 non-null    float64
 7   embarked     712 non-null    object
 8   class        712 non-null    category
 9   who          712 non-null    object
 10  adult_male   712 non-null    bool
 11  embark_town  712 non-null    object
 12  alive        712 non-null    object
 13  alone        712 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 69.0+ KB

In [99]:
final_712.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [ ]:
## 누락데이터 치환 
누락데이터를 대체할 값을 계산해서(평균, 최빈값 등) 치환한다.
fillna() 함수 사용하며 inplace 옵션을 추가해야한다.

In [ ]:
## titanic data set에서 누락된 age의 값은 평균으로 채운다.

In [24]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
print(df['age'].head(20))

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: age, dtype: float64

In [40]:
age_mean = df['age'].mean()
df['age'].fillna(age_mean, inplace=True)

print(df['age'].head(20))

0     22.000000
1     38.000000
2     26.000000
3     35.000000
4     35.000000
5     29.699118
6     54.000000
7      2.000000
8     27.000000
9     14.000000
10     4.000000
11    58.000000
12    20.000000
13    39.000000
14    14.000000
15    55.000000
16     2.000000
17    29.699118
18    31.000000
19    29.699118
Name: age, dtype: float64

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [48]:
df['embark_town'][828:833]

828     Queenstown
829            NaN
830      Cherbourg
831    Southampton
832      Cherbourg
Name: embark_town, dtype: object

In [ ]:
## 컬럼의 구성값 확인 
value_counts()
unique()

In [50]:
df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [66]:
df['embark_town'].value_counts().idxmax()

'Southampton'

In [58]:
df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

1. 바로 위 데이터로 채우기
2. 바로 아래 데이터로 채우기
3. 가장 많이 나온 데이터로 채우기

In [ ]:
## 가장 많이 나오는 데이터

In [92]:
embark_town_max = df['embark_town'].value_counts().idxmax()
embark_town_max

'Southampton'

In [94]:
df['embark_town'].fillna(embark_town_max, inplace=True)

In [96]:
df['embark_town'].isna().sum()

0

In [100]:
df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown'], dtype=object)

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [102]:
df['embark_town'][828:833]

828     Queenstown
829    Southampton
830      Cherbourg
831    Southampton
832      Cherbourg
Name: embark_town, dtype: object

In [110]:
df = sns.load_dataset('titanic')
age_mean = df['age'].mean()

In [114]:
df['age'] = df['age'].fillna(age_mean)

In [134]:
df['embark_town'].bfill(inplace=True)

In [136]:
df['embark_town'][827:833]

827      Cherbourg
828     Queenstown
829      Cherbourg
830      Cherbourg
831    Southampton
832      Cherbourg
Name: embark_town, dtype: object

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
dropna=True : nan data 제외

In [146]:
df['embarked'].value_counts(dropna=True)

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [148]:
df['embarked'].value_counts(dropna=False)

embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

In [152]:
df['embarked'].bfill()

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: embarked, Length: 891, dtype: object

In [156]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
## 누락데이터 처리
* 삭제
* 이전 또는 이후 데이터로 채우기
* 평균값으로 채우기
* 최빈값으로 채우기

In [ ]:
## 중복데이터 처리 
### 중복데이터 확인
duplicated() : 중복이면 True, 중복이 아니면 False
한 행이 다 같은지 판단하며 윗 행과 비교하기때문에 0번째는 False

In [180]:
data = {
    'c1':['a','a','b','a','b'],
    'c2':[1,1,1,2,2],
    'c3':[1,1,2,2,2,],
}
df = pd.DataFrame(data)
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [182]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [184]:
df['c1'].duplicated() # 3, 4 true??

0    False
1     True
2    False
3     True
4     True
Name: c1, dtype: bool

In [186]:
df.drop_duplicates(inplace=True)

In [188]:
df

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [190]:
df.drop_duplicates(['c2', 'c3']) #  뒤의 값이 삭제됨

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [ ]:
## 데이터의 표준화
수집한 데이타의 단위 일치, 대소문자의 변환, 약칭을 일치하는 등의 작업 
표준화는 데이터 포맷을 일치시키는 작업이다

In [ ]:
### 단위 환산
auto-mpg.csv의 mpg열의 값을 표준화 
mpg = mile per gallon => kpl(kilo per liter)

1 mile = 1.6093km
1 gallon = 3.785L
1 mpg = 1 mile / 1 gallon = 0.4240579710144928km/L
1 mpg = 0.425km/L

In [222]:
1.6093/3.795

0.4240579710144928

In [224]:
round(18 * 0.425, 2)

7.65

In [192]:
import pandas as pd
file_path = 'auto-mpg.csv'

columns = ['mpg', 'cylinders', 'displayment', 'horsepower', 'weight', 'acceleration', 'model year', 'origin', 'name']
df = pd.read_csv(file_path, names=columns)
#  df.columns = columns
df.head()

,mpg,cylinders,displayment,horsepower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [200]:
df['kpl'] = round(df['mpg'] * 0.425, 2)

In [202]:
df.head()

,mpg,cylinders,displayment,horsepower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,6.80
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,7.22

In [ ]:
## 자료형 변환
astype 함수로 타입을 변환한다

In [214]:
df['horsepower'].value_counts(dropna=False)

horsepower
150.0    22
90.00    20
88.00    19
110.0    18
100.0    17
         ..
61.00     1
93.00     1
148.0     1
152.0     1
82.00     1
Name: count, Length: 94, dtype: int64

In [220]:
df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [ ]:
### ? => np.nan으로 치환

In [226]:
import numpy as np
df['horsepower'] = df['horsepower'].replace("?", np.nan)

In [232]:
df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', nan, '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [ ]:
### astype 타입 변경

In [238]:
df['horsepower'] = df['horsepower'].astype('float')

In [242]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displayment   398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
 9   kpl           398 non-null    float64
dtypes: float64(6), int64(3), object(1)
memory usage: 31.2+ KB

In [244]:
df['horsepower'].mean()

104.46938775510205

In [ ]:
## origin 컬럼

In [246]:
df['origin'].head()

0    1
1    1
2    1
3    1
4    1
Name: origin, dtype: int64

In [250]:
df['origin'].unique()
df['origin'].value_counts()

origin
1    249
3     79
2     70
Name: count, dtype: int64

In [ ]:
## origin 컬럼 치환
범주형 데이터로 변환 category
1 USA, 2 EU, 3 JPN

In [256]:
df['origin'] = df['origin'].replace({1:"USA",2:"EU",3:"JPN"})
df['origin'].unique()

array(['USA', 'JPN', 'EU'], dtype=object)

In [258]:
df['origin'].dtypes

dtype('O')

In [260]:
df['origin'] = df['origin'].astype('category')

In [262]:
print(df['origin'].dtypes)

category

In [264]:
df['model year'].head(10)

0    70
1    70
2    70
3    70
4    70
5    70
6    70
7    70
8    70
9    70
Name: model year, dtype: int64

In [266]:
df['model year'].unique()

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], dtype=int64)

In [268]:
df['model year'].value_counts()

model year
73    40
78    36
76    34
82    31
75    30
70    29
79    29
80    29
81    29
71    28
72    28
77    28
74    27
Name: count, dtype: int64

In [272]:
df['model year'].sample(5)

304    79
6      70
22     70
56     71
17     70
Name: model year, dtype: int64

In [274]:
df['model year'] = df['model year'].astype('category')

In [276]:
df['model year'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 398 entries, 0 to 397
Series name: model year
Non-Null Count  Dtype
--------------  -----
398 non-null    category
dtypes: category(1)
memory usage: 1.2 KB

In [278]:
df['model year'].sample(10)

270    78
165    75
172    75
235    77
163    75
8      70
206    76
208    76
79     72
156    75
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]

In [ ]:
## 범주형 데이터 구간 분할

In [ ]:
### horsepower nan data 삭제

In [280]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displayment   398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    category
 7   origin        398 non-null    category
 8   name          398 non-null    object
 9   kpl           398 non-null    float64
dtypes: category(2), float64(6), int64(1), object(1)
memory usage: 26.6+ KB

In [286]:
df = df.dropna(subset='horsepower', axis=0)

In [288]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displayment   392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    category
 7   origin        392 non-null    category
 8   name          392 non-null    object
 9   kpl           392 non-null    float64
dtypes: category(2), float64(6), int64(1), object(1)
memory usage: 29.1+ KB

In [290]:
df['horsepower'].value_counts()

horsepower
150.0    22
90.0     20
88.0     19
110.0    18
100.0    17
         ..
61.0      1
93.0      1
148.0     1
152.0     1
82.0      1
Name: count, Length: 93, dtype: int64

In [292]:
df['horsepower'].unique()

array([130., 165., 150., 140., 198., 220., 215., 225., 190., 170., 160.,
        95.,  97.,  85.,  88.,  46.,  87.,  90., 113., 200., 210., 193.,
       100., 105., 175., 153., 180., 110.,  72.,  86.,  70.,  76.,  65.,
        69.,  60.,  80.,  54., 208., 155., 112.,  92., 145., 137., 158.,
       167.,  94., 107., 230.,  49.,  75.,  91., 122.,  67.,  83.,  78.,
        52.,  61.,  93., 148., 129.,  96.,  71.,  98., 115.,  53.,  81.,
        79., 120., 152., 102., 108.,  68.,  58., 149.,  89.,  63.,  48.,
        66., 139., 103., 125., 133., 138., 135., 142.,  77.,  62., 132.,
        84.,  64.,  74., 116.,  82.])


연속된 데이터의 구간을 분할한다 

1구간 : 0 ~ 50
2구간 : 50 ~ 150
3구간 : 150 ~ 200
4구간 : 200 ~ 300
=> 범주 4개 
구간 값 5개 : 0 50 150 200 300 

=> binning 작업 

구간 값을 임의로 지정하기 보다는 

데이터의 분포 이해 : 연속적인 데이터를 범주형 데이터로 변환하여 값의 분포를 더 명확히 이해
데이터 시각화 : 데이터를 구간으로 나누면 히스토그램이나 바 차트로 시각화할 때 더 간단하고 명확하게 표현
분석 및 해석 용이 : 데이터를 그룹화하면 트렌드 파악이 쉬워지고, 데이터를 해석하거나 설명하는 데 유리.
예: 특정 구간(200 이상)에 속하는 값들이 많다면, 그 구간에 대한 추가 분석이나 결론 도출이 가능.

In [302]:
n, bin_div = np.histogram(df['horsepower'], bins=3) # 저출력, 중출력, 고출력 => 4개의 구간

In [308]:
print(bin_div)

[ 46.         107.33333333 168.66666667 230.        ]

In [312]:
bin_names = ['저출력', '보통출력' , '고출력']
df['hp_bin'] = pd.cut(x=df['horsepower'], bins=bin_div, labels=bin_names, include_lowest=True)

C:\Users\kj\AppData\Local\Temp\ipykernel_1612\3781731888.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['hp_bin'] = pd.cut(x=df['horsepower'], bins=bin_div, labels=bin_names, include_lowest=True)

In [ ]:
include_lowest=True : 첫 번째 구간의 하한값(왼쪽 경계)도 포함

In [320]:
df.head()

,mpg,cylinders,displayment,horsepower,weight,acceleration,model year,origin,name,kpl,hp_bin
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu,7.65,보통출력
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320,6.38,보통출력
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite,7.65,보통출력
3,16.0,8,304.0,150.0,3433.0,12.0,70,USA,amc rebel sst,6.80,보통출력
4,17.0,8,302.0,140.0,3449.0,10.5,70,USA,ford torino,7.22,보통출력

In [322]:
df.sample(10)

,mpg,cylinders,displayment,horsepower,weight,acceleration,model year,origin,name,kpl,hp_bin
21,24.0,4,107.0,90.0,2430.0,14.5,70,EU,audi 100 ls,10.20,저출력
6,14.0,8,454.0,220.0,4354.0,9.0,70,USA,chevrolet impala,5.95,고출력
107,18.0,6,232.0,100.0,2789.0,15.0,73,USA,amc gremlin,7.65,저출력
360,30.7,6,145.0,76.0,3160.0,19.6,81,EU,volvo diesel,13.05,저출력
379,36.0,4,98.0,70.0,2125.0,17.3,82,USA,mercury lynx l,15.30,저출력
120,19.0,4,121.0,112.0,2868.0,15.5,73,EU,volvo 144ea,8.07,보통출력
76,18.0,4,121.0,112.0,2933.0,14.5,72,EU,volvo 145e (sw),7.65,보통출력
10,15.0,8,383.0,170.0,3563.0,10.0,70,USA,dodge challenger se,6.38,고출력
290,15.5,8,351.0,142.0,4054.0,14.3,79,USA,ford country squire (sw),6.59,보통출력
372,27.0,4,151.0,90.0,2735.0,18.0,82,USA,pontiac phoenix,11.48,저출력

In [ ]:
## 더미 변수 활용

one-hot-encoding
   저출력 보통출력 고출력
0    0       1       0
6    0       0       1

범주형데이터를 수치로 변경

In [332]:
horsepower_dummies = pd.get_dummies(df['hp_bin'])

horsepower_dummies.head(10)

     저출력   보통출력    고출력
0  False   True  False
1  False   True  False
2  False   True  False
3  False   True  False
4  False   True  False
5  False  False   True
6  False  False   True
7  False  False   True
8  False  False   True
9  False  False   True

In [338]:

# 컬럼 위치 변경 
df_copy = df[:]

cols = ['name'] + [col for col in df.columns if col != 'name']
df_copy = df_copy[cols]

df_copy


# 열 순서를 인덱스로 재정의
# columns = list(df.columns)
# columns[0], columns[2] = columns[2], columns[0]  # 첫 번째와 세 번째 열 교환
# df = df[columns]
# print(df)

# 'name' 열을 맨 앞으로 이동
# col_to_move = df.pop('name')  # 'C' 열 제거 및 값 반환
# df.insert(0, 'name', col_to_move)  # 맨 앞(0번째 위치)에 'name' 열 삽입
# print(df)

,name,mpg,cylinders,displayment,horsepower,weight,acceleration,model year,origin,kpl,hp_bin
0,chevrolet chevelle malibu,18.0,8,307.0,130.0,3504.0,12.0,70,USA,7.65,보통출력
1,buick skylark 320,15.0,8,350.0,165.0,3693.0,11.5,70,USA,6.38,보통출력
2,plymouth satellite,18.0,8,318.0,150.0,3436.0,11.0,70,USA,7.65,보통출력
3,amc rebel sst,16.0,8,304.0,150.0,3433.0,12.0,70,USA,6.80,보통출력
4,ford torino,17.0,8,302.0,140.0,3449.0,10.5,70,USA,7.22,보통출력
...,...,...,...,...,...,...,...,...,...,...,...
393,ford mustang gl,27.0,4,140.0,86.0,2790.0,15.6,82,USA,11.48,저출력
394,vw pickup,44.0,4,97.0,52.0,2130.0,24.6,82,EU,18.70,저출력
395,dodge rampage,32.0,4,135.0,84.0,2295.0,11.6,82,USA,13.60,저출력
396,ford ranger,28.0,4,120.0,79.0,2625.0,18.6,82,USA,11.90,저출력
397,chevy s-10,31.0,4,119.0,82.0,2720.0,19.4,82,USA,13.18,저출력

In [ ]:
## 정규화

각 열의 데이터 범위를 동일한 크기 기준의 비율로 나타내는 방법

1 ~ -1, 0 ~ 1 

A
1
10
100
1000 => 1

B
1
2
3
4
5 => 1

열의 최대값으로 나누어준다
1    => 0.001
10   => 0.01
100  => 0.1
1000 => 1

In [352]:
tmp_data = {
    "A":[1,10,100,1000,10000],
    "B":[1,2,3,4,5],
}

tmp_df = pd.DataFrame(tmp_data)

a = tmp_df.A / tmp_df.A.max()
b = tmp_df['B'] / tmp_df['B'].max()

print(a)
print(b)

0    0.0001
1    0.0010
2    0.0100
3    0.1000
4    1.0000
Name: A, dtype: float64
0    0.2
1    0.4
2    0.6
3    0.8
4    1.0
Name: B, dtype: float64

In [340]:
df['horsepower'] / df['horsepower'].max()

0      0.565217
1      0.717391
2      0.652174
3      0.652174
4      0.608696
         ...
393    0.373913
394    0.226087
395    0.365217
396    0.343478
397    0.356522
Name: horsepower, Length: 392, dtype: float64